{"pageProps":{"note":{"id":"dAIbJALaDi5GytOwdazz9","title":"Balancing","desc":"","updated":1641230605722,"created":1641108315833,"custom":{},"fname":"data-structures.binary-trees.balancing","type":"note","vault":{"fsPath":"vault"},"contentHash":"9c00f3a981862039ac63c2e3414bb8b1","links":[],"anchors":{"avl":{"type":"header","text":"AVL","value":"avl","line":26,"column":0,"depth":2},"red-black":{"type":"header","text":"RED-Black","value":"red-black","line":59,"column":0,"depth":2},"insertion":{"type":"header","text":"Insertion","value":"insertion","line":75,"column":0,"depth":4}},"children":[],"parent":"WfdADQRT7cfzOlj1XR8Uz","data":{}},"body":"<h1 id=\"balancing\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#balancing\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Balancing</h1>\n<p>We know that a BST needs to be well balanced to give optimal performance and results, but there are different ways of balancing trees. Here</p>\n<p>One way of balancing BSTs is a tree rotation, tree rotation changes the structure of the tree but does not affect the structure of the tree. Rotations are usually used to balance two branches of different depths.</p>\n<p>In a rotation a node is shifted up while another node is shifted down. Other nodes may need to also be shifted to maintain the integrity of the binary tree. These rotations can change the height of the tree by moving large subtrees. As it can be seen below in both rotations the order of the nodes has not changed but the levels of the nodes has shifted.</p>\n<p>We can also see that due to the rotation that the children of the nodes being rotated are also shifted but still stay the children of the nodes. Only thing changing the level/depth of these nodes. Thus we can see that this is a great way to balance trees as it does not matter if the node in rotation has parents. Hence we can use rotations at any level/depth within the tree.</p>\n<p><img src=\"/Dendron/assets/images/2022-01-02-23-41-37.png\" style=\"max-width:300px;\"></p>\n<p>In the example below you can see that we can use rotations to make a tree that is unbalanced balanced by applying rotations.</p>\n<p><img src=\"/Dendron/assets/images/2022-01-02-23-41-52.png\"></p>\n<p>For the tree above after rotation has been applied the tree has been balanced. But balancing trees continually is not optimal hence <strong>AVL</strong> is applied.</p>\n<hr>\n<h2 id=\"avl\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#avl\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>AVL</h2>\n<p>AVL tree are a self balancing BST tree that applies rotation automatically as it's always balanced. Thus it is a much faster operation than most BSTs. When inserting a node the branch is inspected for balancing and the appropriate rotation is applied to make the tree balanced.</p>\n<p>AVL looks at pattern of the branches in a tree where insertion of a node is occurring and looks for four patterns.</p>\n<ul>\n<li>Left-Left</li>\n<li>Left-Right</li>\n<li>Right-Left</li>\n<li>Right-Right</li>\n</ul>\n<p>It performs these rotations after insertion of a new node, applying rotation to the node one or two levels above it or both.</p>\n<p>Left-Left(LL): In this operation a right rotation is performed on the node above the inserted node. As shown in the picture below the inserted node is moved up and the node two levels up is moved down.</p>\n<p><img src=\"/Dendron/assets/images/2022-01-02-23-43-22.png\"></p>\n<p>Left-Right(LR): This is a multi step process where a left rotation on the node above the inserted node is applied moving the above node down and the inserted node up. After which a right rotation is applied on the node that was two levels above the inserted node, moving the inserted node up and the top node down.</p>\n<p><img src=\"/Dendron/assets/images/2022-01-02-23-44-15.png\"></p>\n<p>Right-Left(RL): In this operation a right rotation is performed on the node above the inserted node moving the inserted node up and the above node down. After that a left rotation is performed on the node two that was above two levels the inserted node. moving the above node below the inserted node.</p>\n<p><img src=\"/Dendron/assets/images/2022-01-02-23-44-38.png\"></p>\n<p>Right-Right(RR): In this operation a left rotation is performed on the node above the inserted node, moving it up and the node two levels up down.</p>\n<p><img src=\"/Dendron/assets/images/2022-01-02-23-44-52.png\"></p>\n<p>As can be seen thus far balancing is really easy with AVL trees, But the downsides of AVL is insertion and deletions. In these cases they can be operationally heavy as several rotations per each operation can be required.</p>\n<hr>\n<h2 id=\"red-black\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#red-black\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>RED-Black</h2>\n<p>There is another self balancing tree similar to AVL, the <strong>red-black tree</strong>. This algorithm does not have strict balancing requirements like AVL so its look up is slower than AVL, but its insertion and deletion operation are much faster due to requiring less rotations per operation.</p>\n<p><img src=\"/Dendron/assets/images/2022-01-02-23-46-48.png\"></p>\n<p>How these trees work is that each node in the tree is either red or black, where new inserted nodes are always marked red. After insertion the color of the surrounding nodes is assessed and the nodes are rotated or repainted to achieve the conditions below:</p>\n<ul>\n<li>All red leaves must have only child nodes colored black.</li>\n<li>the root of the tree must always be black</li>\n<li>No matter where you are in the tree, every path to a leave/leaf node must go through the same number of black nodes.</li>\n</ul>\n<p>The tree resulting from this algorithm is not perfectly balanced as AVL trees but its runtime operation for lookup is still O(log n) and for insertion and deletion.</p>\n<p>This is due to the tree having a maximum total height of 2 log (n+1)</p>\n<h4 id=\"insertion\"><a aria-hidden=\"true\" class=\"anchor-heading\" href=\"#insertion\"><svg aria-hidden=\"true\" viewBox=\"0 0 16 16\"><use xlink:href=\"#svg-link\"></use></svg></a>Insertion</h4>\n<p>When a new node is inserted into a red-black tree, the algorithm searches through the tree to find the correct spot based on the value and places the node(similar to BST) then paints the node red. After that is complete it assesses the surrounding nodes and performs either of these 4 actions:</p>\n<ol>\n<li>\n<p>In the first case the new nodes parent is black, the red-black properties are upheld and nothing is done.</p>\n</li>\n<li>\n<p>The second case the new nodes parent and its siblings are painted red. Here you would switch the color of the parent and parent sibling node to black and switch the grandparent to the node to red.</p>\n</li>\n<li>\n<p>Here the new nodes parent is red and its sibling is black, and the new nodes value is between the parent and grandparent.</p>\n<ul>\n<li>If the new node is greater than the parent, the parent is rotated left, where as if the node is less than the parent the parent is rotated right.</li>\n</ul>\n</li>\n<li>\n<p>The last case is where the new nodes parent is red and the parent sibling is black. The parent node should be between the value of the new node and the grandparent.</p>\n<ul>\n<li>If the new node value is less than the parent, the grandparent is rotated right and the colors of the parent and grandparent are swapped.</li>\n<li>if the new node value is greater than the parent, the grandparent is rotated left and the colors are swapped.</li>\n</ul>\n</li>\n</ol>\n<p>For the tree below if we were to insert 7, based on rules of BST it will be inserted in the right branch of 6. After which we would follow the cases outlined above, The grandparent (1) is rotated left and the colors of grandparent and parent nodes and it's children are switched.</p>\n<p><img src=\"/Dendron/assets/images/2022-01-02-23-47-14.png\"></p>\n<p>Another example:\n<img src=\"/Dendron/assets/images/2022-01-02-23-47-35.png\"></p>\n<hr>\n<p>In general AVL and red-black trees will have a faster runtime for lookup compared to BST and binary tree.</p>\n<p>Thus we can say that if a runtime of a algorithm for lookup is closer to O(N) we know that it will not be AVL or red-black trees as their lookup time is guaranteed to be in O(log n).</p>\n<p>When looking at creating a tree and if we're choosing between AVL and red-black, we look and see if we will be doing lots of insertion and deletion operations if so the best bet is to go with red-black trees. But if the tree is static or unchanging the best tree to use would be AVL.</p>","noteIndex":{"id":"vVFnvX3AZLb21JIc7L4gm","title":"Root","desc":"","updated":1641184503497,"created":1640015760017,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"dbe76e060067b9059e208c353b2be0be","links":[],"anchors":{"computer-science-library":{"type":"header","text":"Computer Science Library","value":"computer-science-library","line":8,"column":0,"depth":1}},"children":["Yvra9LpGoPLi4Kk2KKGsK","jL0XOOMd1sy4tgf2SWfg5","rydiHYJbn3JhvGgWrK9Sl","l8rNoqR6OrTiJzqzAsfms","Zd60tpALGBOrNJC2avO70","aVtnDm5TBmQfxOgRoc0m1","gh9HX9yN4MF2djOLFCV3N","BeyqjmB3iu9oewp7hCpqg","PbPnrOhcARThoz7ymnam8"],"parent":null,"data":{},"body":"\n# Computer Science Library\n\nThis is a collection of notes ranging from data structures and problems to specific knowledge of a programming language. It is a stored knowledge of different programming languages and applications for easy retrieval and note keeping.\n\nThis repository will be continually updated and maintained as knowledge base grows and aspects of languages are updated.\n\n![](/assets/images/2022-01-02-23-34-36.png)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":4,"useFMTitle":true,"useNoteTitleForLink":true,"mermaid":true,"useKatex":true,"dev":{"enablePreviewV2":true},"site":{"assetsPrefix":"/Dendron","siteUrl":"https://nahombefekadu.github.io","copyAssets":true,"siteHierarchies":["root"],"siteRootDir":"docs","usePrettyRefs":true,"title":"Dendron","description":"Personal knowledge space","siteLastModified":true,"gh_edit_branch":"main","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"usePrettyLinks":true,"siteNotesDir":"notes","siteFaviconPath":"favicon.ico","gh_edit_link":true,"gh_edit_link_text":"Edit this page on GitHub","gh_root":"docs/","gh_edit_view_mode":"edit","writeStubs":true,"siteIndex":"root"},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":false,"leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2,"vaultSelectionModeOnCreate":"smart"}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{}},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link"},"graph":{"zoomSpeed":1},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false}}},"__N_SSG":true}